      * Customer Credit Limit Check
      * This program checks if a customer has exceeded their credit limit
      
     C     *ENTRY        PLIST
     C                   PARM                    CUSTNO           6
     C                   PARM                    ORDAMT          11 2
     C                   PARM                    APPROV           1
      
      * Get customer credit information
     C     CUSTNO        CHAIN     CUSTMST                           99
     C                   IF        NOT *IN99
     C                   EVAL      TOTORD = ORDAMT + ORDBAL
      * Check if total orders exceed credit limit
     C                   IF        TOTORD > CRLIMIT
     C                   EVAL      APPROV = 'N'
     C                   ELSE
     C                   EVAL      APPROV = 'Y'
     C                   ENDIF
     C                   ELSE
     C                   EVAL      APPROV = 'X'                   
     C                   ENDIF
      
      * Update customer order balance if approved
     C                   IF        APPROV = 'Y'
     C                   EVAL      ORDBAL = TOTORD
     C                   UPDATE    CUSTMST
     C                   ENDIF
      
     C                   SETON                                        LR 